tylertms/dspic33e-sim/conformance/nvm.c
#include <inttypes.h>
#include <stdbool.h>
#include <stdint.h>
#include <stdio.h>

#include "device.h"
#include "dspic33.h"

typedef struct {
    uint32_t cases;
    uint32_t passed;
    uint32_t failed;
} NvmConformance;

enum {
    NVM_CONTROL = 0x0728u,
    NVM_ADDRESS = 0x072au,
    NVM_ADDRESS_HIGH = 0x072cu,
    NVM_KEY = 0x072eu,
    NVM_WRITE = 0x8000u,
    NVM_WRITE_ENABLE = 0x4000u,
    NVM_WRITE_ERROR = 0x2000u,
    NVM_IRQ = 15u,
    NVM_SEQUENCE_BASE = 0x0400u,
    MOVE_KEY_55 = 0x200550u,
    MOVE_KEY_AA = 0x200aa0u,
    WRITE_NVM_KEY = 0x883970u,
    SET_NVM_WRITE = 0xa8e729u
};

static void expect(NvmConformance* state, bool condition, const char* name) {
    state->cases++;
    if (condition) {
        state->passed++;
    } else {
        state->failed++;
        printf("[nvm-failed] %s\n", name);
    }
}

static bool interrupt_flag(Dspic33* cpu) {
    return (dspic33_read_word(cpu, 0x0800u) & 0x8000u) != 0u;
}

static uint32_t program_word(const Dspic33* cpu, uint32_t address) {
    if (address < DSPIC33_PROGRAM_LIMIT) {
        return cpu->program[address / 2u];
    }
    return cpu->persistent_program[(address - DSPIC33_PERSISTENT_PROGRAM_BASE) / 2u];
}

static void configure_operation(Dspic33* cpu, uint16_t operation, uint32_t address,
                                bool write_enable) {
    dspic33_write_word(cpu, NVM_ADDRESS, (uint16_t)address);
    dspic33_write_word(cpu, NVM_ADDRESS_HIGH, (uint16_t)(address >> 16u));
    dspic33_write_word(cpu, NVM_CONTROL,
                       (uint16_t)(operation | (write_enable ? NVM_WRITE_ENABLE : 0u)));
}

static bool step_instructions(Dspic33* cpu, uint8_t count) {
    uint8_t index;
    for (index = 0u; index < count; index++) {
        if (dspic33_step(cpu) != DSPIC33_RUNNING) {
            return false;
        }
    }
    return true;
}

static void load_start_sequence(Dspic33* cpu, bool delayed_write) {
    dspic33_load_program_word(cpu, NVM_SEQUENCE_BASE, MOVE_KEY_55);
    dspic33_load_program_word(cpu, NVM_SEQUENCE_BASE + 2u, WRITE_NVM_KEY);
    dspic33_load_program_word(cpu, NVM_SEQUENCE_BASE + 4u, MOVE_KEY_AA);
    dspic33_load_program_word(cpu, NVM_SEQUENCE_BASE + 6u, WRITE_NVM_KEY);
    dspic33_load_program_word(cpu, NVM_SEQUENCE_BASE + 8u,
                              delayed_write ? 0x000000u : SET_NVM_WRITE);
    dspic33_load_program_word(cpu, NVM_SEQUENCE_BASE + 10u, SET_NVM_WRITE);
    cpu->pc = NVM_SEQUENCE_BASE;
}

static bool execute_start_sequence(Dspic33* cpu, bool delayed_write) {
    load_start_sequence(cpu, delayed_write);
    return step_instructions(cpu, delayed_write ? 6u : 5u);
}

static bool start_operation(Dspic33* cpu, uint16_t operation, uint32_t address) {
    configure_operation(cpu, operation, address, true);
    if (!execute_start_sequence(cpu, false)) {
        return false;
    }
    return cpu->nvm.active;
}

static bool finish_operation(Dspic33* cpu) { return dspic33_device_advance(cpu, 2u); }

static void reset_and_access_cases(NvmConformance* state, Dspic33* cpu) {
    dspic33_reset(cpu, 0u);
    expect(state, dspic33_read_word(cpu, NVM_CONTROL) == 0u, "NVMCON reset");
    expect(state, dspic33_read_word(cpu, NVM_KEY) == 0u, "NVMKEY read zero");
    expect(state, !cpu->nvm.active, "NVM reset inactive");
    dspic33_write_word(cpu, NVM_CONTROL, NVM_WRITE_ERROR);
    expect(state, dspic33_read_word(cpu, NVM_CONTROL) == NVM_WRITE_ERROR,
           "WRERR software set");
    dspic33_write_word(cpu, NVM_CONTROL, 0u);
    expect(state, dspic33_read_word(cpu, NVM_CONTROL) == 0u, "WRERR software clear");

    configure_operation(cpu, 1u, 0x2000u, true);
    dspic33_write_word(cpu, NVM_CONTROL,
                       (uint16_t)(dspic33_read_word(cpu, NVM_CONTROL) | NVM_WRITE));
    expect(state, !cpu->nvm.active, "WR without keys rejected");
    expect(state, (dspic33_read_word(cpu, NVM_CONTROL) & NVM_WRITE) == 0u,
           "rejected WR remains clear");
    expect(state, (dspic33_read_word(cpu, NVM_CONTROL) & NVM_WRITE_ERROR) != 0u,
           "rejected WR sets WRERR");
    expect(state, cpu->events.count == 0u, "rejected WR queues no event");
    expect(state, !interrupt_flag(cpu), "rejected WR raises no interrupt");
    dspic33_write_word(cpu, NVM_CONTROL, NVM_WRITE_ENABLE | 1u);
    expect(state, (dspic33_read_word(cpu, NVM_CONTROL) & NVM_WRITE_ERROR) == 0u,
           "WRERR clears after rejected write");
}

static void key_sequence_cases(NvmConformance* state, Dspic33* cpu) {
    dspic33_reset(cpu, 0u);
    configure_operation(cpu, 1u, 0x2000u, true);
    dspic33_write_word(cpu, NVM_KEY, 0x00aau);
    dspic33_write_word(cpu, NVM_KEY, 0x0055u);
    dspic33_write_word(cpu, NVM_CONTROL, NVM_WRITE_ENABLE | NVM_WRITE | 1u);
    expect(state, !cpu->nvm.active, "reverse keys rejected");
    expect(state, (dspic33_read_word(cpu, NVM_CONTROL) & NVM_WRITE_ERROR) != 0u,
           "reverse keys set WRERR");

    dspic33_reset(cpu, 0u);
    configure_operation(cpu, 1u, 0x2000u, true);
    dspic33_write_word(cpu, NVM_KEY, 0x0055u);
    dspic33_write_word(cpu, NVM_KEY, 0x0000u);
    dspic33_write_word(cpu, NVM_KEY, 0x00aau);
    dspic33_write_word(cpu, NVM_CONTROL, NVM_WRITE_ENABLE | NVM_WRITE | 1u);
    expect(state, !cpu->nvm.active, "wrong intervening key rejected");

    dspic33_reset(cpu, 0u);
    configure_operation(cpu, 1u, 0x2000u, true);
    dspic33_write_word(cpu, NVM_KEY, 0x0055u);
    dspic33_write_word(cpu, NVM_KEY, 0x0055u);
    dspic33_write_word(cpu, NVM_CONTROL, NVM_WRITE_ENABLE | NVM_WRITE | 1u);
    expect(state, !cpu->nvm.active, "repeated first key rejected");

    dspic33_reset(cpu, 0u);
    configure_operation(cpu, 1u, 0x2000u, false);
    expect(state, execute_start_sequence(cpu, false), "missing WREN sequence executes");
    expect(state, !cpu->nvm.active, "missing WREN rejected");
    expect(state, (dspic33_read_word(cpu, NVM_CONTROL) & NVM_WRITE_ERROR) != 0u,
           "missing WREN sets WRERR");

    dspic33_reset(cpu, 0u);
    configure_operation(cpu, 1u, 0x2000u, true);
    expect(state, execute_start_sequence(cpu, true), "delayed WR sequence executes");
    expect(state, !cpu->nvm.active, "expired WR window rejected");
    expect(state, (dspic33_read_word(cpu, NVM_CONTROL) & NVM_WRITE_ERROR) != 0u,
           "expired WR window sets WRERR");

    dspic33_reset(cpu, 0u);
    dspic33_load_program_word(cpu, 0x2000u, 0x00ffffffu);
    dspic33_load_program_word(cpu, 0x2002u, 0x00ffffffu);
    cpu->write_latches[0] = 0x00123456u;
    cpu->write_latches[1] = 0x00654321u;
    expect(state, start_operation(cpu, 1u, 0x2000u), "exact key window starts");
    expect(state, cpu->instructions == 5u,
           "canonical sequence executes five instructions");
    expect(state, (dspic33_read_word(cpu, NVM_CONTROL) & NVM_WRITE) != 0u,
           "valid start sets WR");
    expect(state, (dspic33_read_word(cpu, NVM_CONTROL) & NVM_WRITE_ERROR) != 0u,
           "valid start sets WRERR pending state");
    dspic33_write_word(cpu, NVM_CONTROL, 1u);
    expect(state, (dspic33_read_word(cpu, NVM_CONTROL) & NVM_WRITE) != 0u,
           "software zero cannot clear active WR");
    expect(state, cpu->events.count == 1u, "active write has one completion event");
    dspic33_write_word(cpu, NVM_CONTROL, NVM_WRITE | 1u);
    expect(state, cpu->events.count == 1u, "repeated WR does not reschedule");
    expect(state, finish_operation(cpu), "valid key operation completes");
    expect(state, (dspic33_read_word(cpu, NVM_CONTROL) & NVM_WRITE_ERROR) == 0u,
           "normal completion clears WRERR");
    expect(state,
           program_word(cpu, 0x2000u) == 0x00123456u &&
               program_word(cpu, 0x2002u) == 0x00654321u,
           "canonical sequence programs pair");

    dspic33_reset(cpu, 0u);
    configure_operation(cpu, 1u, 0x2000u, true);
    load_start_sequence(cpu, false);
    expect(state, step_instructions(cpu, 2u), "step through first key");
    dspic33_load_program_word(cpu, 0x0016u, NVM_SEQUENCE_BASE + 4u);
    dspic33_write_word(cpu, 0x0800u, 0x0002u);
    dspic33_write_word(cpu, 0x0820u, 0x0002u);
    dspic33_write_word(cpu, 0x0840u, 0x0030u);
    expect(state, dspic33_device_service_interrupt(cpu), "interrupt between keys");
    expect(state, step_instructions(cpu, 3u), "step remainder after key interrupt");
    expect(state, !cpu->nvm.active, "interrupt invalidates first key");

    dspic33_reset(cpu, 0u);
    configure_operation(cpu, 1u, 0x2000u, true);
    load_start_sequence(cpu, false);
    expect(state, step_instructions(cpu, 4u), "step through second key");
    dspic33_load_program_word(cpu, 0x0016u, NVM_SEQUENCE_BASE + 8u);
    dspic33_write_word(cpu, 0x0800u, 0x0002u);
    dspic33_write_word(cpu, 0x0820u, 0x0002u);
    dspic33_write_word(cpu, 0x0840u, 0x0030u);
    expect(state, dspic33_device_service_interrupt(cpu), "interrupt before WR");
    expect(state, step_instructions(cpu, 1u), "step WR after interrupt");
    expect(state, !cpu->nvm.active, "interrupt invalidates unlocked WR");

    dspic33_reset(cpu, 0u);
    configure_operation(cpu, 1u, 0x2000u, true);
    load_start_sequence(cpu, false);
    expect(state, step_instructions(cpu, 4u), "step unlock before trap");
    dspic33_load_program_word(cpu, 0x000eu, NVM_SEQUENCE_BASE + 8u);
    dspic33_raise_dma_collision_trap(cpu);
    expect(state, step_instructions(cpu, 1u), "step WR after trap");
    expect(state, !cpu->nvm.active, "trap invalidates unlocked WR");
}

static void key_byte_access_cases(NvmConformance* state, Dspic33* cpu) {
    dspic33_reset(cpu, 0u);
    configure_operation(cpu, 1u, 0x2100u, true);
    dspic33_load_program_word(cpu, 0x2100u, 0x00ffffffu);
    dspic33_load_program_word(cpu, 0x2102u, 0x00ffffffu);
    cpu->write_latches[0] = 0x00010203u;
    cpu->write_latches[1] = 0x00040506u;
    cpu->instructions = 1u;
    dspic33_write_byte(cpu, NVM_KEY, 0x55u);
    cpu->instructions = 3u;
    dspic33_write_byte(cpu, NVM_KEY, 0xaau);
    cpu->instructions = 4u;
    dspic33_write_byte(cpu, NVM_CONTROL + 1u, 0xc0u);
    expect(state, cpu->nvm.active, "low-byte keys authorize WR");
    expect(state, cpu->nvm.key_instruction == 3u,
           "low-byte AA captures instruction number");
    expect(state, finish_operation(cpu), "low-byte key operation completes");
    expect(state,
           program_word(cpu, 0x2100u) == 0x00010203u &&
               program_word(cpu, 0x2102u) == 0x00040506u,
           "low-byte key operation programs pair");

    dspic33_reset(cpu, 0u);
    configure_operation(cpu, 1u, 0x2100u, true);
    cpu->instructions = 1u;
    dspic33_write_byte(cpu, NVM_KEY, 0x55u);
    cpu->instructions = 2u;
    dspic33_write_byte(cpu, NVM_KEY + 1u, 0xaau);
    cpu->instructions = 3u;
    dspic33_write_byte(cpu, NVM_CONTROL + 1u, 0xc0u);
    expect(state, !cpu->nvm.active, "high-byte key write does not authorize WR");
    expect(state, (dspic33_read_word(cpu, NVM_CONTROL) & NVM_WRITE_ERROR) != 0u,
           "high-byte key attempt sets WRERR");
}

static void invalid_operation_cases(NvmConformance* state, Dspic33* cpu) {
    uint16_t operation;
    for (operation = 4u; operation < 16u; operation++) {
        if (operation == 0x0au || operation == 0x0du) {
            continue;
        }
        dspic33_reset(cpu, 0u);
        configure_operation(cpu, operation, 0x2000u, true);
        expect(state, execute_start_sequence(cpu, false),
               "reserved operation sequence executes");
        expect(state, !cpu->nvm.active, "invalid NVMOP rejected");
        expect(state, (dspic33_read_word(cpu, NVM_CONTROL) & NVM_WRITE) == 0u,
               "invalid NVMOP leaves WR clear");
        expect(state, (dspic33_read_word(cpu, NVM_CONTROL) & NVM_WRITE_ERROR) != 0u,
               "invalid NVMOP sets WRERR");
        expect(state, cpu->events.count == 0u, "invalid NVMOP queues no event");
        expect(state, !interrupt_flag(cpu), "invalid NVMOP raises no interrupt");
    }
}

static void invalid_target_cases(NvmConformance* state, Dspic33* cpu) {
    static const uint32_t targets[] = {0x2000u, DSPIC33_CONFIGURATION_BASE,
                                       DSPIC33_CONFIGURATION_BASE,
                                       DSPIC33_CONFIGURATION_BASE};
    uint16_t operation;
    for (operation = 0u; operation < 4u; operation++) {
        dspic33_reset(cpu, 0u);
        configure_operation(cpu, operation, targets[operation], true);
        expect(state, execute_start_sequence(cpu, false),
               "invalid target sequence executes");
        expect(state, !cpu->nvm.active, "invalid operation target rejected");
        expect(state, (dspic33_read_word(cpu, NVM_CONTROL) & NVM_WRITE_ERROR) != 0u,
               "invalid operation target sets WRERR");
        expect(state, cpu->events.count == 0u, "invalid target queues no event");
        expect(state, !interrupt_flag(cpu), "invalid target raises no interrupt");
    }
    dspic33_reset(cpu, 0u);
    configure_operation(cpu, 0u, DSPIC33_CONFIGURATION_BASE + 5u, true);
    expect(state, execute_start_sequence(cpu, false),
           "synthetic configuration sequence executes");
    expect(state, !cpu->nvm.active, "synthetic configuration address rejected");
    expect(state, (dspic33_read_word(cpu, NVM_CONTROL) & NVM_WRITE_ERROR) != 0u,
           "synthetic configuration address sets WRERR");
}

