tylertms/dspic33e-sim/conformance/nvm.c
static void program_range_cases(NvmConformance* state, Dspic33* cpu) {
    dspic33_reset(cpu, 0u);
    dspic33_load_program_word(cpu, 0x557fcu, 0x00ffffffu);
    dspic33_load_program_word(cpu, 0x557feu, 0x00ffffffu);
    cpu->write_latches[0] = 0x00112233u;
    cpu->write_latches[1] = 0x00445566u;
    expect(state, start_operation(cpu, 1u, 0x557feu), "main upper pair starts");
    expect(state, finish_operation(cpu), "main upper pair completes");
    expect(state,
           program_word(cpu, 0x557fcu) == 0x00112233u &&
               program_word(cpu, 0x557feu) == 0x00445566u,
           "main upper pair programmed");

    dspic33_reset(cpu, 0u);
    configure_operation(cpu, 1u, DSPIC33_PROGRAM_LIMIT, true);
    expect(state, execute_start_sequence(cpu, false),
           "main out-of-range sequence executes");
    expect(state, !cpu->nvm.active, "main out-of-range pair rejected");
}

static void configuration_operation_cases(NvmConformance* state, Dspic33* cpu) {
    uint32_t target = DSPIC33_CONFIGURATION_BASE + 4u;
    dspic33_reset(cpu, 0u);
    expect(state, dspic33_load_configuration_word(cpu, target, 0xffffu),
           "load configuration register pair");
    cpu->write_latches[0] = 0x00a55au;
    expect(state, start_operation(cpu, 0u, target), "configuration byte starts");
    expect(state, finish_operation(cpu), "configuration byte completes");
    expect(state, dspic33_read_configuration_byte(cpu, target) == 0x5au,
           "configuration target byte programmed");
    expect(state, dspic33_read_configuration_byte(cpu, target + 1u) == 0xffu,
           "configuration adjacent byte unchanged");
    expect(state, !cpu->nvm.active, "configuration completion inactive");
    expect(state, (dspic33_read_word(cpu, NVM_CONTROL) & NVM_WRITE) == 0u,
           "configuration completion clears WR");
    expect(state, interrupt_flag(cpu), "configuration completion raises NVMIF");
}

static void pair_and_capture_cases(NvmConformance* state, Dspic33* cpu) {
    dspic33_reset(cpu, 0u);
    expect(state, dspic33_load_program_word(cpu, 0x2200u, 0x00f0f0f0u),
           "load pair first target");
    expect(state, dspic33_load_program_word(cpu, 0x2202u, 0x000f0f0fu),
           "load pair second target");
    expect(state, dspic33_load_program_word(cpu, 0x2300u, 0x00112233u),
           "load pair alternate target");
    cpu->write_latches[0] = 0x00123456u;
    cpu->write_latches[1] = 0x00654321u;
    expect(state, start_operation(cpu, 1u, 0x2202u), "pair operation starts");
    expect(state, cpu->nvm.address == 0x2202u, "pair address captured");
    expect(state, (cpu->nvm.control & 0x000fu) == 1u, "pair operation captured");
    cpu->write_latches[0] = 0x00000000u;
    cpu->write_latches[1] = 0x00000000u;
    dspic33_write_word(cpu, NVM_ADDRESS, 0x2300u);
    dspic33_write_word(cpu, NVM_CONTROL, NVM_WRITE_ENABLE | 3u);
    dspic33_write_word(cpu, 0x0760u, 0xffffu);
    dspic33_write_word(cpu, 0x0762u, 0xffffu);
    dspic33_write_word(cpu, 0x0764u, 0xffffu);
    dspic33_write_word(cpu, 0x0766u, 0xffffu);
    dspic33_write_word(cpu, 0x0768u, 0xffffu);
    dspic33_write_word(cpu, 0x076au, 0xffffu);
    dspic33_write_word(cpu, 0x076cu, 0xffffu);
    expect(state, (dspic33_read_word(cpu, NVM_CONTROL) & NVM_WRITE) != 0u,
           "captured operation remains active after register changes");
    expect(state, finish_operation(cpu), "captured pair completes");
    expect(state, program_word(cpu, 0x2200u) == 0x00103050u,
           "captured pair first word programmed");
    expect(state, program_word(cpu, 0x2202u) == 0x00050301u,
           "captured pair second word programmed");
    expect(state, program_word(cpu, 0x2300u) == 0x00112233u,
           "changed address remains untouched");
    expect(state, cpu->write_latches[0] == 0u && cpu->write_latches[1] == 0u,
           "post-start latch values retained");
    expect(state, interrupt_flag(cpu), "pair completion raises NVMIF");
}

static void row_operation_cases(NvmConformance* state, Dspic33* cpu) {
    uint32_t index;
    dspic33_reset(cpu, 0u);
    for (index = 0u; index < DSPIC33_WRITE_LATCH_WORDS; index++) {
        dspic33_load_program_word(cpu, 0x2400u + index * 2u, 0x00ffffffu);
        cpu->write_latches[index] = 0x00550000u | index;
    }
    dspic33_load_program_word(cpu, 0x23feu, 0x00010203u);
    dspic33_load_program_word(cpu, 0x2500u, 0x00040506u);
    expect(state, start_operation(cpu, 2u, 0x247au), "row operation starts");
    expect(state, finish_operation(cpu), "row operation completes");
    expect(state, program_word(cpu, 0x2400u) == 0x00550000u,
           "row first word programmed");
    expect(state, program_word(cpu, 0x247eu) == 0x0055003fu,
           "row middle word programmed");
    expect(state, program_word(cpu, 0x24feu) == 0x0055007fu,
           "row last word programmed");
    expect(state, program_word(cpu, 0x23feu) == 0x00010203u,
           "row preceding word unchanged");
    expect(state, program_word(cpu, 0x2500u) == 0x00040506u,
           "row following word unchanged");
    expect(state,
           cpu->write_latches[0] == 0x00550000u &&
               cpu->write_latches[DSPIC33_WRITE_LATCH_WORDS - 1u] == 0x0055007fu,
           "row completion retains write latches");
    dspic33_load_program_word(cpu, 0x2600u, 0x00ffffffu);
    dspic33_load_program_word(cpu, 0x2602u, 0x00ffffffu);
    expect(state, start_operation(cpu, 1u, 0x2600u), "retained-latch pair starts");
    expect(state, finish_operation(cpu), "retained-latch pair completes");
    expect(state,
           program_word(cpu, 0x2600u) == 0x00550000u &&
               program_word(cpu, 0x2602u) == 0x00550001u,
           "second target reuses retained write latches");
}

static void erase_operation_cases(NvmConformance* state, Dspic33* cpu) {
    dspic33_reset(cpu, 0u);
    dspic33_load_program_word(cpu, 0x27feu, 0x00010203u);
    dspic33_load_program_word(cpu, 0x2800u, 0u);
    dspic33_load_program_word(cpu, 0x2c00u, 0u);
    dspic33_load_program_word(cpu, 0x2ffeu, 0u);
    dspic33_load_program_word(cpu, 0x3000u, 0x00040506u);
    expect(state, start_operation(cpu, 3u, 0x2abcu), "page erase starts");
    expect(state, finish_operation(cpu), "page erase completes");
    expect(state, program_word(cpu, 0x2800u) == 0x00ffffffu, "page first word erased");
    expect(state, program_word(cpu, 0x2c00u) == 0x00ffffffu, "page middle word erased");
    expect(state, program_word(cpu, 0x2ffeu) == 0x00ffffffu, "page last word erased");
    expect(state, program_word(cpu, 0x27feu) == 0x00010203u,
           "page preceding word unchanged");
    expect(state, program_word(cpu, 0x3000u) == 0x00040506u,
           "page following word unchanged");
}

