tylertms/dspic33e-sim/conformance/nvm.c
static void stall_and_interrupt_cases(NvmConformance* state, Dspic33* cpu) {
    dspic33_reset(cpu, 0u);
    dspic33_load_program_word(cpu, 0x0032u, 0x000100u);
    dspic33_load_program_word(cpu, 0x0100u, 0x000000u);
    dspic33_write_word(cpu, 0x0820u, 0x8000u);
    dspic33_write_word(cpu, 0x0846u, 0x3000u);
    expect(state, start_operation(cpu, 1u, 0x3200u), "stall operation starts");
    expect(state, dspic33_step(cpu) == DSPIC33_RUNNING,
           "completion stall cycle advances");
    expect(state, !cpu->nvm.active && interrupt_flag(cpu),
           "completion ends stall and raises NVMIF");
    expect(state,
           cpu->pc == NVM_SEQUENCE_BASE + 10u && cpu->instructions == 5u &&
               cpu->interrupt_count == 0u,
           "completion cycle defers interrupt service");
    expect(state, dspic33_step(cpu) == DSPIC33_RUNNING,
           "post-completion instruction advances");
    expect(state, cpu->last_interrupt == NVM_IRQ && cpu->interrupt_count == 1u,
           "NVM interrupt serviced after stall");
    expect(state, cpu->pc == 0x0102u && cpu->instructions == 6u,
           "NVM vector instruction executes after service");
}

static void async_suppression_cases(NvmConformance* state, Dspic33* cpu) {
    dspic33_reset(cpu, 0u);
    dspic33_set_async_events(cpu, false);
    expect(state, start_operation(cpu, 1u, 0x3a00u),
           "suppressed-events operation starts");
    expect(state, dspic33_step(cpu) == DSPIC33_RUNNING,
           "suppressed-events completion cycle");
    expect(state, !cpu->nvm.active && cpu->events.count == 0u,
           "suppressed-events completion removes NVM event");
    expect(state, interrupt_flag(cpu), "suppressed-events completion raises NVMIF");

    dspic33_reset(cpu, 0u);
    expect(state, start_operation(cpu, 1u, 0x3c00u), "disable-during operation starts");
    expect(state, dspic33_schedule(cpu, DSPIC33_EVENT_INTERRUPT, 1u, 0u, 5u),
           "queue unrelated event during NVM");
    dspic33_set_async_events(cpu, false);
    expect(state, dspic33_step(cpu) == DSPIC33_RUNNING,
           "disabled-during completion cycle");
    expect(state, !cpu->nvm.active && cpu->events.count == 1u,
           "disabled-during keeps unrelated event only");
    dspic33_write_word(cpu, 0x0800u, 0u);
    dspic33_set_async_events(cpu, true);
    expect(state, dspic33_device_advance(cpu, 5u), "advance retained unrelated event");
    expect(state, (dspic33_read_word(cpu, 0x0800u) & 0x0002u) != 0u,
           "retained unrelated event dispatched");
    expect(state, (dspic33_read_word(cpu, 0x0800u) & 0x8000u) == 0u,
           "stale NVM event does not redispatch");

    dspic33_reset(cpu, 0u);
    dspic33_set_async_events(cpu, false);
    expect(state, start_operation(cpu, 1u, 0x3e00u), "reenabled operation starts");
    dspic33_set_async_events(cpu, true);
    expect(state, dspic33_step(cpu) == DSPIC33_RUNNING,
           "reenabled operation completion cycle");
    expect(state, !cpu->nvm.active && cpu->events.count == 0u,
           "reenabled operation completes without stale event");
}

static void reset_copy_and_failure_cases(NvmConformance* state, Dspic33* cpu) {
    Dspic33 copy;
    bool initialized;
    dspic33_reset(cpu, 0u);
    dspic33_load_program_word(cpu, 0x3400u, 0x00ffffffu);
    cpu->write_latches[0] = 0x00112233u;
    expect(state, start_operation(cpu, 1u, 0x3400u), "reset-abort operation starts");
    dspic33_reset(cpu, 0u);
    expect(state, !cpu->nvm.active && cpu->events.count == 0u,
           "POR aborts operation and event");
    expect(state, dspic33_read_word(cpu, NVM_CONTROL) == 0u, "POR clears WR and WRERR");
    expect(state, program_word(cpu, 0x3400u) == 0x00ffffffu,
           "POR-aborted operation does not program");
    expect(state, cpu->write_latches[0] == 0x00ffffffu, "POR resets write latches");

    initialized = dspic33_initialize(&copy);
    expect(state, initialized, "initialize NVM copy");
    if (initialized) {
        dspic33_reset(cpu, 0u);
        dspic33_load_program_word(cpu, 0x3600u, 0x00ffffffu);
        cpu->write_latches[0] = 0x00010203u;
        cpu->write_latches[1] = 0x00040506u;
        expect(state, start_operation(cpu, 1u, 0x3600u), "copy operation starts");
        expect(state, dspic33_copy(&copy, cpu), "copy active NVM state");
        expect(state, copy.nvm.active && copy.events.count == 1u,
               "copy retains active event");
        expect(state,
               copy.nvm.address == cpu->nvm.address &&
                   copy.nvm.latches[1] == cpu->nvm.latches[1],
               "copy retains captured operation");
        expect(state, finish_operation(&copy), "copied operation completes");
        expect(state,
               program_word(&copy, 0x3600u) == 0x00010203u &&
                   program_word(&copy, 0x3602u) == 0x00040506u,
               "copied event programs captured pair");
        expect(state, cpu->nvm.active && program_word(cpu, 0x3600u) == 0x00ffffffu,
               "source operation remains independent");
        dspic33_destroy(&copy);
    }

    dspic33_reset(cpu, 0u);
    configure_operation(cpu, 1u, 0x3800u, true);
    cpu->cycles = 1u;
    cpu->device_cycles = UINT64_MAX;
    cpu->instructions = 1u;
    cpu->nvm.key_stage = 2u;
    cpu->nvm.key_instruction = 0u;
    dspic33_write_word(cpu, NVM_CONTROL, NVM_WRITE_ENABLE | NVM_WRITE | 1u);
    expect(state, !cpu->nvm.active, "event overflow cancels operation");
    expect(state, cpu->events.count == 0u, "event overflow queues no completion");
    expect(state, (dspic33_read_word(cpu, NVM_CONTROL) & NVM_WRITE) == 0u,
           "event overflow clears WR");
    expect(state, (dspic33_read_word(cpu, NVM_CONTROL) & NVM_WRITE_ERROR) != 0u,
           "event overflow sets WRERR");

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, NVM_CONTROL, NVM_WRITE_ENABLE | NVM_WRITE_ERROR | 2u);
    dspic33_load_program_word(cpu, 0u, 0xfe0000u);
    expect(state, dspic33_step(cpu) == DSPIC33_RUNNING, "software reset executes");
    expect(state, cpu->software_reset_count == 1u, "software reset counted");
    expect(state,
           dspic33_read_word(cpu, NVM_CONTROL) ==
               (NVM_WRITE_ENABLE | NVM_WRITE_ERROR | 2u),
           "warm reset preserves NVMCON POR-only fields");
}

int main(void) {
    Dspic33 cpu;
    NvmConformance state = {0u, 0u, 0u};
    bool initialized = dspic33_initialize(&cpu);
    expect(&state, initialized, "initialize NVM processor");
    if (initialized) {
        reset_and_access_cases(&state, &cpu);
        key_sequence_cases(&state, &cpu);
        key_byte_access_cases(&state, &cpu);
        invalid_operation_cases(&state, &cpu);
        invalid_target_cases(&state, &cpu);
        program_range_cases(&state, &cpu);
        configuration_operation_cases(&state, &cpu);
        pair_and_capture_cases(&state, &cpu);
        row_operation_cases(&state, &cpu);
        erase_operation_cases(&state, &cpu);
        stall_and_interrupt_cases(&state, &cpu);
        async_suppression_cases(&state, &cpu);
        reset_copy_and_failure_cases(&state, &cpu);
        dspic33_destroy(&cpu);
    }
    printf("[nvm-summary] cases=%" PRIu32 " passed=%" PRIu32 " failed=%" PRIu32 "\n",
           state.cases, state.passed, state.failed);
    return state.failed == 0u ? 0 : 1;
}
